In [10]:
import numpy as np
import pandas as pd

In [11]:
dog = pd.read_csv('dogs.csv')
dog.head()

      Name       Breed   Color   Height(cm)   Weight(kg)  Date of Birth
0    Bella    Labrador   Brown           56           25     2013-07-01
1  Charlie      Poodle   Black           43           23     2016-09-16
2     Lucy        Chow   Brown           46           22     2014-08-25
3   Cooper   Schnauzer    Gray           49           17     2011-12-11
4      Max    Labrador   Black           59           29     2017-01-20

In [12]:
dog.values

array([['Bella', ' Labrador', ' Brown', 56, 25, ' 2013-07-01'],
       ['Charlie', ' Poodle', ' Black', 43, 23, ' 2016-09-16'],
       ['Lucy', ' Chow', ' Brown', 46, 22, ' 2014-08-25'],
       ['Cooper', ' Schnauzer', ' Gray', 49, 17, ' 2011-12-11'],
       ['Max', ' Labrador', ' Black', 59, 29, ' 2017-01-20'],
       ['Stella', ' Chihuahua', ' Tan', 18, 2, ' 2015-04-20'],
       ['Bernie', ' St. Bernard', ' White', 77, 74, ' 2018-02-2']],
      dtype=object)

In [13]:
dog.columns

Index(['Name', 'Breed', ' Color', ' Height(cm)', ' Weight(kg)',
       ' Date of Birth'],
      dtype='object')

In [16]:
dog.sort_values(by='Name')

      Name         Breed   Color   Height(cm)   Weight(kg)  Date of Birth
0    Bella      Labrador   Brown           56           25     2013-07-01
6   Bernie   St. Bernard   White           77           74      2018-02-2
1  Charlie        Poodle   Black           43           23     2016-09-16
3   Cooper     Schnauzer    Gray           49           17     2011-12-11
2     Lucy          Chow   Brown           46           22     2014-08-25
4      Max      Labrador   Black           59           29     2017-01-20
5   Stella     Chihuahua     Tan           18            2     2015-04-20

In [19]:
dog[' Color']

0     Brown
1     Black
2     Brown
3      Gray
4     Black
5       Tan
6     White
Name:  Color, dtype: object

In [20]:
dog.sort_values(by='Name')

      Name         Breed   Color   Height(cm)   Weight(kg)  Date of Birth
0    Bella      Labrador   Brown           56           25     2013-07-01
6   Bernie   St. Bernard   White           77           74      2018-02-2
1  Charlie        Poodle   Black           43           23     2016-09-16
3   Cooper     Schnauzer    Gray           49           17     2011-12-11
2     Lucy          Chow   Brown           46           22     2014-08-25
4      Max      Labrador   Black           59           29     2017-01-20
5   Stella     Chihuahua     Tan           18            2     2015-04-20

In [21]:
dog.sort_values(by='Breed', ascending='False')

      Name         Breed   Color   Height(cm)   Weight(kg)  Date of Birth
5   Stella     Chihuahua     Tan           18            2     2015-04-20
2     Lucy          Chow   Brown           46           22     2014-08-25
0    Bella      Labrador   Brown           56           25     2013-07-01
4      Max      Labrador   Black           59           29     2017-01-20
1  Charlie        Poodle   Black           43           23     2016-09-16
3   Cooper     Schnauzer    Gray           49           17     2011-12-11
6   Bernie   St. Bernard   White           77           74      2018-02-2

In [22]:
color = dog[' Color'] == 'Brown'
breed = dog['Breed'] == 'Chow'
dog[color & breed]

Empty DataFrame
Columns: [Name, Breed,  Color,  Height(cm),  Weight(kg),  Date of Birth]
Index: []

In [25]:
dog['Breed'] == ' Chow'

0    False
1    False
2     True
3    False
4    False
5    False
6    False
Name: Breed, dtype: bool

In [26]:
dog[' Height(cm)'].mode()

0    18
1    43
2    46
3    49
4    56
5    59
6    77
dtype: int64

In [27]:
dog[' Height(cm)'].mean()

49.714285714285715

In [28]:
dog[' Weight(kg)'].mean()

27.428571428571427

In [29]:
def pct40(column): return column.quantile(0.4)

In [31]:
dog[' Weight(kg)'].agg([pct40])

pct40    22.4
Name:  Weight(kg), dtype: float64

In [32]:
dog[' Height(cm)'].agg([pct40])

pct40    47.2
Name:  Height(cm), dtype: float64

In [33]:
pd.DataFrame(dog[' Height(cm)'].cumsum()).head(4)

    Height(cm)
0           56
1           99
2          145
3          194

In [34]:
pd.DataFrame(dog[' Weight(kg)'].cumsum()).head(4)

    Weight(kg)
0           25
1           48
2           70
3           87

In [36]:
pd.DataFrame(dog[' Color'].value_counts())

         Color
 Brown       2
 Black       2
 Tan         1
 White       1
 Gray        1

In [37]:
dog[dog[' Color'] == 'Brown'][' Height(cm)'].mean()

nan

In [39]:
dog[dog[' Color'] == 'Black'][' Weight(kg)'].mean()

nan

In [40]:
dog.groupby([' Color', 'Breed'])[
    [' Height(cm)', ' Weight(kg)']].agg(['count', 'min', 'max'])

                     Height(cm)          Weight(kg)
                          count min max       count min max
 Color Breed
 Black  Labrador              1  59  59           1  29  29
        Poodle                1  43  43           1  23  23
 Brown  Chow                  1  46  46           1  22  22
        Labrador              1  56  56           1  25  25
 Gray   Schnauzer             1  49  49           1  17  17
 Tan    Chihuahua             1  18  18           1   2   2
 White  St. Bernard           1  77  77           1  74  74

In [42]:
dog.pivot_table(values=' Weight(kg)', index=' Height(cm)', aggfunc=np.median)

              Weight(kg)
 Height(cm)
18                     2
43                    23
46                    22
49                    17
56                    25
59                    29
77                    74